# PointOnEdge Properties

---
The PointOnEdge type exposes the following members.
| Name| Description
---|---|---
| LocationOnCurve| The point location on curve.
Top
#### Reference
PointOnEdge Class
Autodesk.Revit.DB Namespace